/*
[문제]
연도가 주어졌을 때, 윤년이면 1, 아니면 0을 출력하는 프로그램을 작성하시오.
윤년은 연도가 4의 배수이면서, 100의 배수가 아닐 때 또는 400의 배수일 때이다.

예를 들어, 2012년은 4의 배수이면서 100의 배수가 아니라서 윤년이다.
1900년은 100의 배수이고 400의 배수는 아니기 때문에 윤년이 아니다.
하지만, 2000년은 400의 배수이기 때문에 윤년이다.

[입력]
첫째 줄에 연도가 주어진다. 연도는 1보다 크거나 같고, 4000보다 작거나 같은 자연수이다.

[출력]
첫째 줄에 윤년이면 1, 아니면 0을 출력한다.

[예제입력1 / 예제출력1]
2000 / 1

[예제입력2 / 예제출력2]
1999 / 0
*/

//첫번째 풀이

//fs모듈로 입력값 받기
var fs = require('fs');
var input = fs.readFileSync('/dev/stdin').toString().split(' ');

//입력되는 연도를 정수로 변환
let year = parseInt(input);

/*윤년의 조건을 제대로 파악한 뒤, 논리연산자를 활용해 한 번에 조건으로 넣었다.
&&(AND) 연산자와 ||(OR)연산자 사용*/
if ((year%4 ==0 && year%100 !=0) || year%400 ==0){
console.log(1);
} else {
console.log(0);
};


//두 번째 풀이

//fs모듈로 입력값 받기
var fs = require('fs');
var input = fs.readFileSync('/dev/stdin').toString().split(' ');

//입력되는 연도를 정수로 변환
let year = parseInt(input);

/* (1) 400의 배수이면 1 출력(윤년), 그렇지 않을 경우 
(2) 4의 배수이면서 100의 배수가 아니면 1 출력(윤년)
(3) 위 두 조건을 모두 충족하지 않으면 0 출력(윤년x) */
if (year%400 ==0) {
console.log(1);
} else if (year%4 ==0 && year%100 !=0 ) {
console.log(1);}
else {
console.log(0);};
